{
  "classification": "your objective is to create a model to predict the value of the label of your dataset containing a discrete value",
  "plot": "you want to visualize graphically the result, I will decide for the best method to show the obtained results.",
  "clustering": "you want to define a model able to detect similar groups in your data.",
  "outliersDetection": "you want to identify the outliers, a sample that differs from all the others",
  "kmeans": "you want to cluster, that means finding groups of data that are similar, using kMeans algorithm",
  "featureSelection": "you want to extract a subset of columns of the dataset (features).",
  "performance": "your aim aim is to measure the performances of your model.",
  "correlation": "you want to see how the features are related to each other, that is, the degree to which two variables move in coordination with one another",
  "associationRules": "you want to find some \"if-then\" rules that describe the relation between the features (the columns) in your dataset.",
  "featureImportance": "you want to see how much important is each column in the final model. It describes how much a feature influences the classification of your target variable.",
  "ds": "",
  "statistics": "you want to see some statistics that describes your dataset",
  "range": "",
  "distplot": "you want to visualize your data in a plot representing its distribution",
  "preprocessing": "",
  "pca": "you want to reduce the dimensionality of the dataset creating fictional variables that are a combination of the existing ones",
  "logisticRegression": "you want create a model to predict the value of  the target label of your dataset containing a discrete value, using Logistic Regression algorithm",
  "randomForest": "you want create a model to predict the value of  the target label of your dataset containing a discrete value, using Random Forest algorithm",
  "scatterplot": "you want to visualize your data through a scatterplot. It uses dots to represent the relation between two variables of your dataset.",
  "pearson": "",
  "regression": "your objective is to create a model to predict the value of the label of your dataset containing a numerical value",
  "boxplot": "you want to visualize your data through through a boxplot. It is a plot in which a rectangle is drawn to represent the second and third quartiles, usually with a line inside to indicate the median value.",
  "spearman": "",
  "clustermap": "you want to visualize your data through as a hierarchically-clustered heatmap. It uses a hierarchical clusters to order data by similarity. This reorganizes the data for the rows and columns and displays similar content next to one another for even more depth of understanding the data."
}