{
  "classification": {
    "summary" : "your objective is to predict the value of the the column ##LABEL## using the other data in your table.",
    "example": "suppose you are the owner of a , you want to bla bla bla",
    "explanation" : "from your request I understood you want to apply classification, an analysis that tries to predict the value of a column of your dataset, called label, from the other data in the table. In this way, you aim at creating an algorithm that can be used on new, unseen, data to predict the value of that column",
    "readableName" : "classification"
  },
  "plot": {
    "summary": "you want to visualize the results in a plot."
  },
  "clustering": {
    "summary": "you want to group your data in such a way that objects in the same group (called a cluster) are more similar (in some sense) to each other than to those in other groups (clusters).",
    "explanation": "from your request I understood you want to apply classification, an analysis that aims at finding groups of data similar each other (clusters). This kind of analysis doesn't require any additional information from you, it works in total autonomy.",
    "readableName" : "clustering"
  },
  "outliersDetection": {
    "summary": "you want to identify the outliers, that are rare items, events or observations which raise suspicions by differing significantly from the majority of the data."
  },
  "featureSelection": {
    "summary": "you want to select the columns of the dataset (features) that are most relevant to your problem."
  },
  "correlation": {
    "summary": "you want to see how the features are statistically related to each other.",
    "explanation": "from your request I understood you want to apply correlation, a statistical tool that find relations between pairs of columns in the dataset. Finding correlated variables (columns) means that the value of one increases, the other one increases as well, and vice versa. The two variables can be also anti-correlated: when one increases the other decreases and viceversa."
  },
  "associationRules": {
    "summary": "you want to find some \"if-then\" rules that describe the relationship between the features (the columns) in your dataset.",
    "explanation": "from your request I understood you want to apply association rules. It is a machine learning algorithm that scans your table to try to elicit rules that describe the data in your table. That rules are in the form of \"if-then\" clauses, for example \"if the customer buys a shirt and a pair of trousers, then he buy also a pair of socks\"",
    "readableName" : "association rules"
  },
  "featureImportance": {
    "summary": "you want to see which are the most influencing features (columns of the table) in the final prediction."
  },
  "regression": {
    "summary": "your objective is to predict the value of ##LABEL## column using the others data in the table.",
    "explanation": "from your request I understood you want to apply regression, an analysis that tries to predict a numerical value from your dataset. In this way, you aim at creating an algorithm that can be used on new, unseen, data to predict that column."
  }
}